OpenFOAM-1706/tutorials/motorBike/system/minMax
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

minMax
{
    // Type of functionObject
    type            fieldMinMax;

    // Where to load it from (if not already in solver)
    libs               ("libfieldFunctionObjects.so");

    // Log to output (default: false)
    log             true;

    // Fields to be monitored - runTime modifiable
    fields
    (
        U
        p
    );
}

// ************************************************************************* //
